Repository: lv7777/w3c_cors
Catalog: w3c_cors-level2.tmx
Source language: en_us
Languages: ja

source: #acknowledgments
ja: #謝辞

source: #conformance
ja: #準拠

source: #introduction
ja: #導入

source: #references
ja: #参考文献

source: #security
ja: #セキュリティ

source: #syntax
ja: #構文

source: #terminology
ja: #用語

source: (Similarly to requests using a method that is not a simple method.)
ja: (同様にリクエストにsimple methodではないメソッドを使用する。)

source: Fetch the request URL from origin source origin using referrer source as override referrer source with the manual redirect flag and the block cookies flag set, using the method OPTIONS, and with the following additional constraints:
ja: manual redirect flag と block cookies flag をセットして、override referrer source として referrer source を使用し、source originから、 OPTIONSメソッドを使いrequest URLにFetchする。その後、以下の追加の制約に進む：

source: W3C's role in making the Recommendation is to draw attention to the specification and to promote its widespread deployment.
ja: 勧告の作成におけるW3Cの役割は、仕様に注意を引き付け、広範な開発を促進することである。

source: GET, unless explicitly set.
ja: 明示的に設定されない場合GETが設定される。

source: HTTP and URI.
ja: HTTPやURIの仕様のものである。

source: https is not allowed because of certificate errors
ja: 証明書のエラーのため、httpsを指定することはできない。

source: https to http is not allowed.
ja: httpsからhttpの(リクエスト)は許可されていない。

source: Content-Type is to be listed as only a subset of its values makes it qualify as simple header.
ja: Content-Typeはその値のサブセットとしてのみリストされ、simple headerと見なされる。

source: Converting a string to ASCII lowercase means replacing all characters in the range U+0041 LATIN CAPITAL LETTER A to U+005A LATIN CAPITAL LETTER Z with the corresponding characters in the range U+0061 LATIN SMALL LETTER A to U+007A LATIN SMALL LETTER Z).
ja: 文字列をASCII lowercaseに変換する とはU+0041 LATIN CAPITAL LETTER A to U+005A LATIN CAPITAL LETTER Zの範囲と一致する全ての文字列をそれと一致する U+0061 LATIN SMALL LETTER A to U+007A LATIN SMALL LETTER Z 内の文字に変換するという意味である。

source: 1 Introduction
ja: 1 導入

source: 2 Conformance
ja: 2 準拠

source: 3 Terminology
ja: 3 用語

source: 4 Security Considerations
ja: 4 セキュリティに関する考慮事項

source: 5 Syntax
ja: 5 構文

source: 5.1 Access-Control-Allow-Origin Response Header
ja: 5.1 Access-Control-Allow-Origin レスポンスヘッダ

source: 5.2 Access-Control-Allow-Credentials Response Header
ja: 5.2 Access-Control-Allow-Credentialsレスポンスヘッダ

source: 6.4 Implementation Considerations
ja: 6.4 実装に関する考慮事項

source: 7 User Agent Processing Model
ja: 7 User Agentの処理モデル

source: 7.1.1 Handling a Response to a Cross-Origin Request
ja: 7.1.1 Cross-Origin Requestのレスポンスを処理する

source: 7.1.5 Cross-Origin Request with Preflight
ja: 7.1.5 Preflightリクエストを伴ったCross-Origin Request

source: 7.1.7 Generic Cross-Origin Request Algorithms
ja: 7.1.7 通常のCross-Origin Requestアルゴリズム

source: 7.2 Resource Sharing Check
ja: 7.2 リソース共有のチェック

source: 7.3 Security
ja: 7.3 セキュリティ

source: 8.1 Constructing a Cross-Origin Request
ja: 8.1 クロス オリジン要求の生成

source: 8.2 Dealing with Same Origin to Cross-Origin Redirects
ja: 8.2 同一オリジンからクロスオリジンへのリダイレクトの対応

source: 8.3 Dealing with the Cross-Origin Request Status
ja: 8.3 クロスオリジンリクエストのステータスに関して

source: 8.4 Security
ja: 8.4 セキュリティ

source: This does not include HTTP responses that indicate some type of error, such as HTTP status code 410.
ja: これにはHTTPステータスコード410のような、エラーのタイプのHTTPレスポンスは含まれていない。

source: A simple cross-origin request has been defined as congruent with those which may be generated by currently deployed user agents that do not conform to this specification.
ja: simple cross-origin requestは、この仕様に準拠していない現在展開されているユーザエージェントによって生成されるものと一致するものとして定義されている

source: A GET response whose entity body happens to parse as ECMAScript can return an Access-Control-Allow-Origin header whose value is "*" provided there are no sensitive comments as it can be accessed cross-origin using an HTML script element.
ja: 機密性のあるコメントがなく、HTMLscript要素を使用してクロスオリジンとしてアクセスできるECMAScriptとして解析される GET レスポンスのボディは 値が"*"のAccess-Control-Allow-Originヘッダを返すことができる。[参照:http://security.stackexchange.com/questions/43936/does-returning-access-control-allow-origin-weaken-the-security-of-json-get-re/43965#43965]

source: A list of exposed headers consisting of zero or more header field names of headers other than the simple response headers that the resource might use and can be exposed.
ja: リソースが使用して、リソースを公開することのできる simple response headers 以外のヘッダのヘッダフィールド名から構成されている0以上の 公開されているヘッダのリスト 。

source: A list of headers consisting of zero or more header field names that are supported by the resource.
ja: リソースがサポートしている0、もしくはそれ以上の ヘッダフィールド名 から構成されている ヘッダのリスト。

source: A list of methods consisting of zero or more methods that are supported by the resource.
ja: リソースがサポートしている0、もしくはそれ以上の メソッド から構成されている メソッドのリスト。

source: A list of origins consisting of zero or more origins that are allowed access to the resource.
ja: リソースにアクセスするのを許可されている 0、もしくはそれ以上の origins から構成されている オリジンのリスト。

source: A supports credentials flag that indicates whether the resource supports user credentials in the request.
ja: supports credentials フラグはリクエスト内でリソースが user credentialsをサポートするかどうかを指示する。

source: A header is said to be a simple header if the header field name is an ASCII case-insensitive match for Accept, Accept-Language, or Content-Language or if it is an ASCII case-insensitive match for Content-Type and the header field value media type (excluding parameters) is an ASCII case-insensitive match for application/x-www-form-urlencoded, multipart/form-data, or text/plain.
ja: もし ヘッダのフィールド名がASCII case-insensitiveでAccept, Accept-Language, or Content-Language にマッチする場合、 もしくはASCII case-insensitiveでContent-Typeにマッチ、なおかつヘッダフィールドの値メディアタイプ(パラメータ以外)が ASCII case-insensitive でapplication/x-www-form-urlencoded, multipart/form-data, or text/plainにマッチする場合、 そのヘッダはsimple header と呼ばれる。

source: A header is said to be a simple response header if the header field name is an ASCII case-insensitive match for one of the following:
ja: もし ヘッダのフィールド名が ASCII case-insensitive で以下にマッチする場合、 シンプルレスポンスヘッダ と呼ばれる。

source: A method is said to be a simple method if it is a case-sensitive match for one of the following:
ja: もし method が case-sensitiveで以下にマッチする場合、simple methodと呼ばれる:

source: A CORS API specification for an API that only allows requests using the GET method might set request method to GET, request entity body to empty, and source origin to some appropriate value and let the other variables be controlled by the API.
ja: GETメソッドを使用するリクエストのみ許可するAPIのCORS API仕様では、 request method を GETに設定し、request entity body を空にし、 source origin を適切な値に設定し、他の変数をAPIによって制御できるようにします。

source: A conformant resource is one that implements all the requirements listed in this specification that are applicable to resources.
ja: 準拠しているしているリソースはリソースに適用可能であるこの仕様書内のすべての要求リストを実装している。

source: A conformant user agent is one that implements all the requirements listed in this specification that are applicable to user agents.
ja: 準拠しているUAとはこの仕様書にリストされている全ての要求が実装されているUAのことである

source: A cross-origin request with credentials as defined in this specification is used to substitute for alternate methods of authenticated resource sharing, such as server-to-server back channels, JSONP, or cross-document messaging.
ja: この仕様書で定義されている機密情報を持ったクロスオリジンリクエストはサーバー間のバックチャンネル、JSONP、クロスドキュメントメッセージング等の認証されたリソース共有の代わりの方法として使用される。

source: A list of current W3C publications and the latest revision of this technical report can be found in the W3C technical reports index at http://www.w3.org/TR/.
ja: W3Cが現在公開しているリストとテクニカルレポートの最新版は、W3C technical reports index at http://www.w3.org/TR/で見つけることができる。

source: A list of headers set by authors for the request.
ja: リクエストの作成者によって設定されるヘッダのリスト。

source: A resource that is not useful to applications from other origins, such as a login page, ought not to return an Access-Control-Allow-Origin header.
ja: ログインページ等の他のオリジンのアプリケーションで使用できないリソースにはAccess-Control-Allow-Originヘッダを返してはいけない。

source: A resource that is publicly accessible, with no access control checks, can always safely return an Access-Control-Allow-Origin header whose value is "*".
ja: アクセスコントロールがなく、公開されたリソースは常に安全に 値が"*"のAccess-Control-Allow-Originヘッダを返すことができる。

source: A response can include an Access-Control-Allow-Origin header, with the origin of where the request originated from as the value, to allow access to the resource's contents.
ja: レスポンスには要求の発信元のオリジンを値として持つ、リソースの内容にアクセスを許可するためのAccess-Control-Allow-Origin ヘッダを含めることができます。

source: Abstract
ja: 概要

source: Acknowledgments
ja: 謝辞

source: Add one or more Access-Control-Allow-Headers headers consisting of (a subset of) the list of headers.
ja: list of headers(のサブセット)から構成されている1以上のAccess-Control-Allow-Headers ヘッダを付け加える 。

source: Add one or more Access-Control-Allow-Methods headers consisting of (a subset of) the list of methods.
ja: list of methods(のサブセット)から構成されている1以上のAccess-Control-Allow-Methods ヘッダを付け加える 。

source: Again, data received from origins that are not completely trusted has to be validated to conform to expected formats and authorized values.
ja: 再度（また？）、完全に信頼されていないオリジンから受信したデータが期待したフォーマットおよび承認済の値に準拠しているために検証します。

source: Also used when a DNS error, TLS negotiation failure, or other type of network error occurs.
ja: DNS エラーが、 TLS ネゴシエーションの失敗、外のタイプのネットワークエラーが発生した場合などにも使用される。

source: Although this effectively makes the preflight result cache optional, user agents are strongly encouraged to support it.
ja: しかしこれはpreflight result cacheオプションが効果的に作成されるため、UAはこれをサポートすることを強く推奨される。

source: Always matching is acceptable since the list of headers can be unbounded.
ja: list of headers は無制限にできるため、常にマッチングすることが許可される。

source: Always matching is acceptable since the list of methods can be unbounded.
ja: list of methods は無制限にできるため、常にマッチングすることが許可される。

source: Always matching is acceptable since the list of origins can be unbounded.
ja: list of origins は無制限にすることができるため、"常に一致"が許容される。

source: An individual who has actual knowledge of a patent which the individual believes contains Essential Claim(s) must disclose the information in accordance with section 6 of the W3C Patent Policy.
ja: 特許について十分に知識のある人物が、仕様にEssential Claim(s)が認められると判断した場合は、W3C特許ポリシーの第6章に従い情報を開示する必要がある。.

source: An initial implementation report is available, with a supplement for changes since Candidate Recommendation.
ja: 初期版の 実装報告 が、 勧告候補版からの変更の補足とともに使用可能です。

source: Apply the abort steps.
ja: abort stepsを適用する。

source: Apply the cache and network error steps.
ja: cache and network error stepsを適用する。

source: Apply the make a request steps and observe the request rules below while making the request.
ja: make a request steps を適用し、リクエストが作成されるまでの間以下の request rules を監視しなければならない。

source: Apply the network error steps acting as if the algorithm that invoked the cache and network error steps invoked the network error steps instead.
ja: もしアルゴリズムが network error steps の代わりに cache and network error steps を呼び出した場合、network error steps を適用する。

source: Apply the network error steps.
ja: network error stepsを適用する。

source: Apply the redirect steps.
ja: redirect stepsを適用する。

source: As a consequence, authors of such resources should send a Vary: Origin HTTP header or provide other appropriate control directives to prevent caching of such responses, which may be inaccurate if re-used across-origins.
ja: 結果として、そのようなリソースの作成者は、 Vary：Origin </ c3> HTTPヘッダーを送信するか、またはそのような応答のキャッシングを防ぐための適切な制御指令を提供する必要があります。

source: As a substitute for JSONP-style cross-origin credentialed requests, use of this specification significantly improves the security posture of the requesting application, as it provides cross-origin data access whereas JSONP operates via cross-origin code-injection.
ja: JSONP型の機密情報クロスオリジンリクエストの代わりとして、この仕様を使用した場合、JSONP型はクロスオリジンのコードインジェクション経由で命令するのに対してクロスオリジンデータアクセスを提供するのでリクエストするアプリケーションのセキュリティに対する姿勢がかなり上昇する。

source: As a substitute for cross-origin communication techniques relying on loading a resource, with credentials, into an HTML iframe element, and subsequently employing cross-document messaging or other cross-origin side channels, this specification provides a roughly equivalent security posture.
ja: リソースのロードに依存するHTML iframe要素の中に入った資格情報付きのクロスオリジン通信技術の代替として、他のクロスオリジンサイドチャネルまたはクロスオリジン通信技術を実装する場合、この仕様はほぼ同等のセキュリティ状態を提供する。

source: As indicated as the first step of the cross-origin request algorithm and in the redirect steps algorithm user agents are allowed to terminate the algorithm and not make a request.
ja: cross-origin request アルゴリズムの最初のステップと redirect steps アルゴリズム内で示されているUAはリクエストを作成せずにアルゴリズムを終了しても良い。

source: As mentioned, a cross-origin request with preflight uses a preflight result cache.
ja: 既に述べたように、cross-origin request with preflight は preflight result cacheを使用する。

source: As well as sections and appendices marked as non-normative, all diagrams, examples, and notes in this specification are non-normative.
ja: セクション名や付録と同様に、この仕様書の図、例、注釈は準拠ではない。

source: At various places user agents are allowed to take additional precautions.
ja: 様々な場所で、ユーザエージェントは追加の予防策を取ることができる。

source: Authorization for a request should be performed using only the intersection of the authority of the user and the requesting origin(s).
ja: リクエストの許可はユーザーの権限と要求しているオリジンのみを使用して判断する必要がある。

source: Authors of client-side Web applications are strongly encouraged to validate content retrieved from a cross-origin resource as it might be harmful.
ja: クライアント側のウェブアプリケーションの作者には cross-origin から受け取った有害かもしれないリソースを検証することを強く推奨する。

source: Avoiding such attacks requires that the coordinating applications have explicit knowledge of the scope of privilege for each origin and that all parameters and instructions received are carefully validated at each step in the coordination to ensure that effects implied do not exceed the authority of the originating principal.
ja: 前述のような攻撃を避けるためには、アプリケーションがそれぞれのオリジンの特権の範囲の明示的な知識を持つように調整して、受け取ったすべてのパラメータや指示には本来オリジンが持つ権限を越えないよう暗示的な影響を保証するため、"調整"のそれぞれのステップでは注意してバリデーションしなければならない。

source: Because of this, resources for which simple requests have significance other than retrieval must protect themselves from Cross-Site Request Forgery (CSRF) by requiring the inclusion of an unguessable token in the explicitly provided content of the request.
ja: つまり、シンプルリクエストが検索以外の重要性を持つリソースは、要求の明示的に提供される内容に推測不可能なトークンを含めることを要求することによって、クロスサイトリクエストフォージェリ（CSRF）からシンプルリクエストを保護する必要がある。

source: By not adding the appropriate headers resource can also clear the preflight result cache of all entries where origin is a case-sensitive match for the value of the Origin header and url is a case-sensitive match for the URL of the resource.
ja: 適切なヘッダを加えないことでリソースは origin が Origin ヘッダrと case-sensitiveに一致し、なおかつurlがリソースのURLと case-sensitive に一致するすべてのエントリの preflight result cache を消去することもできる。

source: By publishing this Recommendation W3C expects that the functionality specified in this Cross-Origin Resource Sharing Recommendation will not be affected by changes to HTML5 or to HTTP Status Code 308 as those specifications proceed to Recommendation and RFC status respectively.
ja: この勧告を公開することでW3CはCross-Origin Resource Sharing勧告内で仕様が決められている機能はHTML5 や HTTP Status Code 308などの仕様書を勧告に進めることやRFCのステータスの変更への影響を与えない。

source: CORS API specifications also need to ensure not to reveal anything until the cross-origin request status is set to preflight complete or success to prevent e.g. port scanning.
ja: CORS API 仕様はまた、ポートスキャンなどを防止するためにcross-origin request status が preflight complete もしくは success 状態になるまで明示的に何もしないことを保証する必要がある。

source: CORS API specifications are allowed to let these input variables be controlled by the API, but can also set fixed values.
ja: CORS API仕様では、これらの入力変数をAPIで制御できるようになっていますが、固定値を設定することもできます。

source: CORS API specifications are free to limit the abilities of a cross-origin request.
ja: CORS API 仕様はcross-origin requestに自由に制限を課すことができる。

source: Certain types of resources should not attempt to specify particular authorized origins, but instead either deny or allow all origins.
ja: 特定のタイプのリソースを特定の認証されたオリジンとして指定してはいけない。代わりにすべて拒否、もしくはすべて許可にすべきである。

source: Comparing two strings in a case-sensitive manner means comparing them exactly, codepoint for codepoint.
ja: 二つの文字列を比較して case-sensitive であるとは、それらを比較したときコードポイントとコードポイントが正確に一致しているという意味である。

source: Comparing two strings in an ASCII case-insensitive manner means comparing them exactly, codepoint for codepoint, except that the characters in the range U+0041 LATIN CAPITAL LETTER A to U+005A LATIN CAPITAL LETTER Z and the corresponding characters in the range U+0061 LATIN SMALL LETTER A to U+007A LATIN SMALL LETTER Z are considered to also match.
ja: 2つの文字列を比較してASCII case-insensitive であるとは、それらを比較した時、コードポイントとコードポイントが正確に一致し、なおかつその文字がU+0041 LATIN CAPITAL LETTER A to U+005A LATIN CAPITAL LETTER Zの範囲、または U+0061 LATIN SMALL LETTER A to U+007A LATIN SMALL LETTER Z の範囲に収まっている、という意味である。

source: Consider the following scenario:
ja: 以下のシナリオを考えてみる：

source: Cross-origin requests using a method that is simple with author request headers that are not simple will have a preflight request to ensure that the resource can handle those headers.
ja: simple なメソッドを使用して、author request headers がsimpleでないCross-origin requestsを行うとき 、リソースがそれらのヘッダを処理できることを保証するためにpreflight requestを持つ。

source: Depending on the value of the cross-origin request status the API is to react in a different way:
ja: cross-origin request statusの値に応じて異なった方法で反応する。

source: Do not actually terminate the request.
ja: 実際にリクエストを終了してはいけない。

source: Do not request any kind of end user interaction.
ja: エンドユーザーと会話するタイプのリクエストをしてはいけない。

source: Due to the specifics of some APIs this cannot be defined in a generic way and therefore it has to be provided as argument.
ja: いくつかのAPIの仕様のせいで、これは一般的な方法で定義するこができないため、引数として提供する必要がある。

source: E.g. if a user agent disallows requests from the https to the http scheme for a cross-origin request it is encouraged to do the same for the HTML img element.
ja: 例：もしUAが https スキームから http スキームに向かって発信するcross-origin request リクエストを許可しない場合、同じことをHTML img 要素にも適用することを推奨される。

source: E.g. upload progress events for XMLHttpRequest.
ja: 例：XMLHttpRequestのupload progress events。

source: E.g. user agents are allowed to not store cache items, remove cache items before they reached their max-age, and not connect to certain URLs.
ja: 例えば、UAはキャッシュしたアイテムを保存することを許可しない、キャッシュのmax-ageに届く前にキャッシュしたアイテムを削除する、特定の URLsに接続しない、などである。

source: E.g., the omit credentials flag could always be set.
ja: 例：omit credentials flag を常にセットすることができる。

source: Each cross-origin request has an associated cross-origin request status that CORS API specifications that enable an API to make cross-origin requests can hook into.
ja: それぞれの cross-origin request は cross-origin requests にフックできるようにするためのAPIが使用できるCORS API 仕様を持っているcross-origin request status を持っているt。

source: Each entry consists of the following fields:
ja: それぞれのエントリは以下のフィールドから構成されている:

source: Each of the author request headers is a simple header or author request headers is empty.
ja: 各author request headers が simple header である、もしくは author request headers が空である場合。

source: Each type of request a resource might have to deal with is described in its own subsection.
ja: リクエストの各タイプはリソースは自分自身のサブセクションで説明されている問題に対処する必要があるかもしれない。

source: Either a Document or URL.
ja: Document もしくは URLのどちらか。

source: Empty if header is not empty; otherwise one of the values from the Access-Control-Allow-Methods headers.
ja: もし header が空ではない場合、空になる。それ以外の場合、 Access-Control-Allow-Methods ヘッダの値になる。

source: Empty if method is not empty; otherwise one of the values from the Access-Control-Allow-Headers headers.
ja: もし method が空ではない場合、空になる。それ以外の場合、 Access-Control-Allow-Methods ヘッダの値になる。

source: Empty, unless explicitly set.
ja: 明示的に設定されない場合空になる。

source: Ensure not the reveal any further information about the request.
ja: リクエストに関する情報を（オリジンに対して）明らかにしないようにしなければならない。

source: Ensure not to reveal any further information about the request.
ja: リクエストに関する情報を（オリジンに対して）明らかにしないようにしなければならない。

source: Entries can also be added and removed per the algorithms below.
ja: エントリーはまた、下のアルゴリズムごとに追加したり削除したりすることができる。？？？

source: Entries must be removed when the time specified in the max-age field has passed since storing the entry.
ja: エントリが格納されてから、max-age フィールドで指定された時間が過ぎた場合、エントリーはクリアされなければならない。

source: Everything else in this specification is normative.
ja: それ以外の全ては準拠するべき標準である。

source: Examples are Server-Sent Events and XMLHttpRequest.
ja: 例えば are Server-Sent Events や XMLHttpRequestなどがある。

source: Exclude user credentials.
ja: user credentialsを除外する。

source: Exclude the author request headers.
ja: author request headersを除外する。

source: Exclude the request entity body.
ja: request entity bodyを除外する。

source: False if the omit credentials flag is set, or true otherwise.
ja: もしomit credentials flagがセットされている場合、falseになる。それ以外の場合、trueになる。

source: Features that can only be safely exposed after a preflight request can now be enabled.
ja: preflight request後のみ、安全に公開できる機能を有効にできるようになりました。

source: For request method there either is a method cache match or it is a simple method and the force preflight flag is unset.
ja: request method がmethod cache match する、もしくは simple method なおかつ force preflight flag が未設定であるのいずれかにマッチする場合。

source: For APIs that transparently handle redirects CORS API specifications are encouraged to handle this scenario transparently as well by "catching" the redirect and invoking the cross-origin request algorithm on the (cross-origin) redirect URL.
ja: リダイレクト透過的に扱うAPIのために、CORS API 仕様書ではリダイレクトを「キャッチ」して、リダイレクトURL上で cross-origin request アルゴリズムを呼び出すことでこのシナリオを透過的に処理することを推奨している。

source: For all cross-origin requests that APIs can make for which the resource sharing policy in this specification is supposed to apply, the CORS API specification needs to reference the cross-origin request algorithm and set the following input variables appropriately: request URL, request method, author request headers, request entity body, source origin, manual redirect flag, omit credentials flag, and the force preflight flag.
ja: 全てのcross-origin リクエストがこの仕様書内のリソース共有ポリシーが適用することができるAPIのサポートを適用するために、CORS API 仕様書は cross-origin request アルゴリズムを参照し、以下の適切な値を挿入しなければならない： request URL, request method, author request headers, request entity body, source origin, manual redirect flag, omit credentials flag, and the force preflight flag.

source: For each header in headers for which there is no header cache match create a new entry in the preflight result cache with the various fields set as follows:
ja: header cache match が 無い headers 内のそれぞれのヘッダは各種のフィールドに以下の値を設定した新しいpreflight result cache のエントリーを作成する：

source: For each header in headers for which there is a header cache match set the max-age field value of the matching entry to max-age.
ja: header cache match した headers 内のそれぞれのヘッダは マッチしたエントリのmax-age フィールド値を max-ageに設定する。

source: For each method in methods for which there is no method cache match create a new entry in the preflight result cache with the various fields set as follows:
ja: method cache match が ない methods内のそれぞれのメソッドは各種のフィールドに以下の値を設定した新しいpreflight result cache のエントリーを作成する：

source: For each method in methods for which there is a method cache match set the max-age field value of the matching entry to max-age.
ja: method cache matchしたmethods内のそれぞれのメソッドはmax-ageにマッチしたエントリーのmax-age フィールド値を設定する。

source: For every header of author request headers there either is a header cache match for the field name or it is a simple header.
ja: author request headers のすべてのヘッダがフィールド名にheader cache matchしているか、もしくはヘッダがsimple headerであるかのどちらかにマッチしている場合。

source: For example, a web application whose URL is of the type example.org/app-name/ and the app-name portion is necessary to distinguish the web application from other web applications also running at example.org, will be unable to securely employ the mechanism defined in this specification.
ja: 例として、URLが example.org/app-name/ であるアプリケーションが存在しており、app-nameの部分はexample.orgで実行されているほかのウェブアプリケーションと区別する必要のあるとします。また、ほかのアプリケーションはしっかりとこの仕様で定義されたメカニズムを採用することができません。
